frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
/**
 * \file
 *
 * \brief Component description for PM
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_PM_COMPONENT_
#define _SAM4L_PM_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PM */
/* ========================================================================== */
/** \addtogroup SAM4L_PM Power Manager */
/*@{*/

#define PM_I7146
#define REV_PM                      0x441

/* -------- PM_MCCTRL : (PM Offset: 0x000) (R/W 32) Main Clock Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MCSEL:3;          /*!< bit:  0.. 2  Main Clock Select                  */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_MCCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_MCCTRL_OFFSET            0x000        /**< \brief (PM_MCCTRL offset) Main Clock Control */
#define PM_MCCTRL_RESETVALUE        _U(0x00000000); /**< \brief (PM_MCCTRL reset_value) Main Clock Control */

#define PM_MCCTRL_MCSEL_Pos         0            /**< \brief (PM_MCCTRL) Main Clock Select */
#define PM_MCCTRL_MCSEL_Msk         (_U(0x7) << PM_MCCTRL_MCSEL_Pos)
#define PM_MCCTRL_MCSEL(value)      (PM_MCCTRL_MCSEL_Msk & ((value) << PM_MCCTRL_MCSEL_Pos))
#define PM_MCCTRL_MASK              _U(0x00000007) /**< \brief (PM_MCCTRL) MASK Register */

/* -------- PM_CPUSEL : (PM Offset: 0x004) (R/W 32) CPU Clock Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CPUSEL:3;         /*!< bit:  0.. 2  CPU Clock Select                   */
    uint32_t :4;               /*!< bit:  3.. 6  Reserved                           */
    uint32_t CPUDIV:1;         /*!< bit:      7  CPU Division                       */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_CPUSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_CPUSEL_OFFSET            0x004        /**< \brief (PM_CPUSEL offset) CPU Clock Select */
#define PM_CPUSEL_RESETVALUE        _U(0x00000000); /**< \brief (PM_CPUSEL reset_value) CPU Clock Select */

#define PM_CPUSEL_CPUSEL_Pos        0            /**< \brief (PM_CPUSEL) CPU Clock Select */
#define PM_CPUSEL_CPUSEL_Msk        (_U(0x7) << PM_CPUSEL_CPUSEL_Pos)
#define PM_CPUSEL_CPUSEL(value)     (PM_CPUSEL_CPUSEL_Msk & ((value) << PM_CPUSEL_CPUSEL_Pos))
#define   PM_CPUSEL_CPUSEL_0_Val          _U(0x0)   /**< \brief (PM_CPUSEL) fCPU:fmain. CPUDIV: */
#define   PM_CPUSEL_CPUSEL_1_Val          _U(0x1)   /**< \brief (PM_CPUSEL) fCPU:fmain / 2^(CPUSEL+1) */
#define PM_CPUSEL_CPUSEL_0          (PM_CPUSEL_CPUSEL_0_Val        << PM_CPUSEL_CPUSEL_Pos)
#define PM_CPUSEL_CPUSEL_1          (PM_CPUSEL_CPUSEL_1_Val        << PM_CPUSEL_CPUSEL_Pos)
#define PM_CPUSEL_CPUDIV_Pos        7            /**< \brief (PM_CPUSEL) CPU Division */
#define PM_CPUSEL_CPUDIV            (_U(0x1) << PM_CPUSEL_CPUDIV_Pos)
#define PM_CPUSEL_MASK              _U(0x00000087) /**< \brief (PM_CPUSEL) MASK Register */

/* -------- PM_PBASEL : (PM Offset: 0x00C) (R/W 32) PBA Clock Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PBSEL:3;          /*!< bit:  0.. 2  PBA Clock Select                   */
    uint32_t :4;               /*!< bit:  3.. 6  Reserved                           */
    uint32_t PBDIV:1;          /*!< bit:      7  PBA Division Select                */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBASEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBASEL_OFFSET            0x00C        /**< \brief (PM_PBASEL offset) PBA Clock Select */
#define PM_PBASEL_RESETVALUE        _U(0x00000000); /**< \brief (PM_PBASEL reset_value) PBA Clock Select */

#define PM_PBASEL_PBSEL_Pos         0            /**< \brief (PM_PBASEL) PBA Clock Select */
#define PM_PBASEL_PBSEL_Msk         (_U(0x7) << PM_PBASEL_PBSEL_Pos)
#define PM_PBASEL_PBSEL(value)      (PM_PBASEL_PBSEL_Msk & ((value) << PM_PBASEL_PBSEL_Pos))
#define PM_PBASEL_PBDIV_Pos         7            /**< \brief (PM_PBASEL) PBA Division Select */
#define PM_PBASEL_PBDIV             (_U(0x1) << PM_PBASEL_PBDIV_Pos)
#define PM_PBASEL_MASK              _U(0x00000087) /**< \brief (PM_PBASEL) MASK Register */

/* -------- PM_PBBSEL : (PM Offset: 0x010) (R/W 32) PBB Clock Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PBSEL:3;          /*!< bit:  0.. 2  PBB Clock Select                   */
    uint32_t :4;               /*!< bit:  3.. 6  Reserved                           */
    uint32_t PBDIV:1;          /*!< bit:      7  PBB Division Select                */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBBSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBBSEL_OFFSET            0x010        /**< \brief (PM_PBBSEL offset) PBB Clock Select */
#define PM_PBBSEL_RESETVALUE        _U(0x00000000); /**< \brief (PM_PBBSEL reset_value) PBB Clock Select */

