frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
#define PM_PBBSEL_PBSEL_Pos         0            /**< \brief (PM_PBBSEL) PBB Clock Select */
#define PM_PBBSEL_PBSEL_Msk         (_U(0x7) << PM_PBBSEL_PBSEL_Pos)
#define PM_PBBSEL_PBSEL(value)      (PM_PBBSEL_PBSEL_Msk & ((value) << PM_PBBSEL_PBSEL_Pos))
#define PM_PBBSEL_PBDIV_Pos         7            /**< \brief (PM_PBBSEL) PBB Division Select */
#define PM_PBBSEL_PBDIV             (_U(0x1) << PM_PBBSEL_PBDIV_Pos)
#define PM_PBBSEL_MASK              _U(0x00000087) /**< \brief (PM_PBBSEL) MASK Register */

/* -------- PM_PBCSEL : (PM Offset: 0x014) (R/W 32) PBC Clock Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PBSEL:3;          /*!< bit:  0.. 2  PBC Clock Select                   */
    uint32_t :4;               /*!< bit:  3.. 6  Reserved                           */
    uint32_t PBDIV:1;          /*!< bit:      7  PBC Division Select                */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBCSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBCSEL_OFFSET            0x014        /**< \brief (PM_PBCSEL offset) PBC Clock Select */
#define PM_PBCSEL_RESETVALUE        _U(0x00000000); /**< \brief (PM_PBCSEL reset_value) PBC Clock Select */

#define PM_PBCSEL_PBSEL_Pos         0            /**< \brief (PM_PBCSEL) PBC Clock Select */
#define PM_PBCSEL_PBSEL_Msk         (_U(0x7) << PM_PBCSEL_PBSEL_Pos)
#define PM_PBCSEL_PBSEL(value)      (PM_PBCSEL_PBSEL_Msk & ((value) << PM_PBCSEL_PBSEL_Pos))
#define PM_PBCSEL_PBDIV_Pos         7            /**< \brief (PM_PBCSEL) PBC Division Select */
#define PM_PBCSEL_PBDIV             (_U(0x1) << PM_PBCSEL_PBDIV_Pos)
#define PM_PBCSEL_MASK              _U(0x00000087) /**< \brief (PM_PBCSEL) MASK Register */

/* -------- PM_PBDSEL : (PM Offset: 0x018) (R/W 32) PBD Clock Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PBSEL:3;          /*!< bit:  0.. 2  PBD Clock Select                   */
    uint32_t :4;               /*!< bit:  3.. 6  Reserved                           */
    uint32_t PBDIV:1;          /*!< bit:      7  PBD Division Select                */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBDSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBDSEL_OFFSET            0x018        /**< \brief (PM_PBDSEL offset) PBD Clock Select */
#define PM_PBDSEL_RESETVALUE        _U(0x00000000); /**< \brief (PM_PBDSEL reset_value) PBD Clock Select */

#define PM_PBDSEL_PBSEL_Pos         0            /**< \brief (PM_PBDSEL) PBD Clock Select */
#define PM_PBDSEL_PBSEL_Msk         (_U(0x7) << PM_PBDSEL_PBSEL_Pos)
#define PM_PBDSEL_PBSEL(value)      (PM_PBDSEL_PBSEL_Msk & ((value) << PM_PBDSEL_PBSEL_Pos))
#define PM_PBDSEL_PBDIV_Pos         7            /**< \brief (PM_PBDSEL) PBD Division Select */
#define PM_PBDSEL_PBDIV             (_U(0x1) << PM_PBDSEL_PBDIV_Pos)
#define PM_PBDSEL_MASK              _U(0x00000087) /**< \brief (PM_PBDSEL) MASK Register */

/* -------- PM_CPUMASK : (PM Offset: 0x020) (R/W 32) CPU Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OCD:1;            /*!< bit:      0  OCD CPU Clock Mask                 */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_CPUMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_CPUMASK_OFFSET           0x020        /**< \brief (PM_CPUMASK offset) CPU Mask */
#define PM_CPUMASK_RESETVALUE       _U(0x00000001); /**< \brief (PM_CPUMASK reset_value) CPU Mask */

#define PM_CPUMASK_OCD_Pos          0            /**< \brief (PM_CPUMASK) OCD CPU Clock Mask */
#define PM_CPUMASK_OCD              (_U(0x1) << PM_CPUMASK_OCD_Pos)
#define PM_CPUMASK_MASK             _U(0x00000001) /**< \brief (PM_CPUMASK) MASK Register */

/* -------- PM_HSBMASK : (PM Offset: 0x024) (R/W 32) HSB Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PDCA_:1;          /*!< bit:      0  PDCA HSB Clock Mask                */
    uint32_t HFLASHC_:1;       /*!< bit:      1  HFLASHC HSB Clock Mask             */
    uint32_t HRAMC1_:1;        /*!< bit:      2  HRAMC1 HSB Clock Mask              */
    uint32_t USBC_:1;          /*!< bit:      3  USBC HSB Clock Mask                */
    uint32_t CRCCU_:1;         /*!< bit:      4  CRCCU HSB Clock Mask               */
    uint32_t HTOP0_:1;         /*!< bit:      5  HTOP0 HSB Clock Mask               */
    uint32_t HTOP1_:1;         /*!< bit:      6  HTOP1 HSB Clock Mask               */
    uint32_t HTOP2_:1;         /*!< bit:      7  HTOP2 HSB Clock Mask               */
    uint32_t HTOP3_:1;         /*!< bit:      8  HTOP3 HSB Clock Mask               */
    uint32_t AESA_:1;          /*!< bit:      9  AESA HSB Clock Mask                */
    uint32_t :22;              /*!< bit: 10..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_HSBMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_HSBMASK_OFFSET           0x024        /**< \brief (PM_HSBMASK offset) HSB Mask */
#define PM_HSBMASK_RESETVALUE       _U(0x000001E2); /**< \brief (PM_HSBMASK reset_value) HSB Mask */

#define PM_HSBMASK_PDCA_Pos         0            /**< \brief (PM_HSBMASK) PDCA HSB Clock Mask */
#define PM_HSBMASK_PDCA             (_U(0x1) << PM_HSBMASK_PDCA_Pos)
#define PM_HSBMASK_HFLASHC_Pos      1            /**< \brief (PM_HSBMASK) HFLASHC HSB Clock Mask */
#define PM_HSBMASK_HFLASHC          (_U(0x1) << PM_HSBMASK_HFLASHC_Pos)
#define PM_HSBMASK_HRAMC1_Pos       2            /**< \brief (PM_HSBMASK) HRAMC1 HSB Clock Mask */
#define PM_HSBMASK_HRAMC1           (_U(0x1) << PM_HSBMASK_HRAMC1_Pos)
#define PM_HSBMASK_USBC_Pos         3            /**< \brief (PM_HSBMASK) USBC HSB Clock Mask */
#define PM_HSBMASK_USBC             (_U(0x1) << PM_HSBMASK_USBC_Pos)
#define PM_HSBMASK_CRCCU_Pos        4            /**< \brief (PM_HSBMASK) CRCCU HSB Clock Mask */
#define PM_HSBMASK_CRCCU            (_U(0x1) << PM_HSBMASK_CRCCU_Pos)
#define PM_HSBMASK_HTOP0_Pos        5            /**< \brief (PM_HSBMASK) HTOP0 HSB Clock Mask */
#define PM_HSBMASK_HTOP0            (_U(0x1) << PM_HSBMASK_HTOP0_Pos)
#define PM_HSBMASK_HTOP1_Pos        6            /**< \brief (PM_HSBMASK) HTOP1 HSB Clock Mask */
#define PM_HSBMASK_HTOP1            (_U(0x1) << PM_HSBMASK_HTOP1_Pos)
#define PM_HSBMASK_HTOP2_Pos        7            /**< \brief (PM_HSBMASK) HTOP2 HSB Clock Mask */
#define PM_HSBMASK_HTOP2            (_U(0x1) << PM_HSBMASK_HTOP2_Pos)
#define PM_HSBMASK_HTOP3_Pos        8            /**< \brief (PM_HSBMASK) HTOP3 HSB Clock Mask */
#define PM_HSBMASK_HTOP3            (_U(0x1) << PM_HSBMASK_HTOP3_Pos)
#define PM_HSBMASK_AESA_Pos         9            /**< \brief (PM_HSBMASK) AESA HSB Clock Mask */
#define PM_HSBMASK_AESA             (_U(0x1) << PM_HSBMASK_AESA_Pos)
#define PM_HSBMASK_MASK             _U(0x000003FF) /**< \brief (PM_HSBMASK) MASK Register */

