frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
/* -------- PM_PBAMASK : (PM Offset: 0x028) (R/W 32) PBA Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t IISC_:1;          /*!< bit:      0  IISC APB Clock Enable              */
    uint32_t SPI_:1;           /*!< bit:      1  SPI APB Clock Enable               */
    uint32_t TC0_:1;           /*!< bit:      2  TC0 APB Clock Enable               */
    uint32_t TC1_:1;           /*!< bit:      3  TC1 APB Clock Enable               */
    uint32_t TWIM0_:1;         /*!< bit:      4  TWIM0 APB Clock Enable             */
    uint32_t TWIS0_:1;         /*!< bit:      5  TWIS0 APB Clock Enable             */
    uint32_t TWIM1_:1;         /*!< bit:      6  TWIM1 APB Clock Enable             */
    uint32_t TWIS1_:1;         /*!< bit:      7  TWIS1 APB Clock Enable             */
    uint32_t USART0_:1;        /*!< bit:      8  USART0 APB Clock Enable            */
    uint32_t USART1_:1;        /*!< bit:      9  USART1 APB Clock Enable            */
    uint32_t USART2_:1;        /*!< bit:     10  USART2 APB Clock Enable            */
    uint32_t USART3_:1;        /*!< bit:     11  USART3 APB Clock Enable            */
    uint32_t ADCIFE_:1;        /*!< bit:     12  ADCIFE APB Clock Enable            */
    uint32_t DACC_:1;          /*!< bit:     13  DACC APB Clock Enable              */
    uint32_t ACIFC_:1;         /*!< bit:     14  ACIFC APB Clock Enable             */
    uint32_t GLOC_:1;          /*!< bit:     15  GLOC APB Clock Enable              */
    uint32_t ABDACB_:1;        /*!< bit:     16  ABDACB APB Clock Enable            */
    uint32_t TRNG_:1;          /*!< bit:     17  TRNG APB Clock Enable              */
    uint32_t PARC_:1;          /*!< bit:     18  PARC APB Clock Enable              */
    uint32_t CATB_:1;          /*!< bit:     19  CATB APB Clock Enable              */
    uint32_t :1;               /*!< bit:     20  Reserved                           */
    uint32_t TWIM2_:1;         /*!< bit:     21  TWIM2 APB Clock Enable             */
    uint32_t TWIM3_:1;         /*!< bit:     22  TWIM3 APB Clock Enable             */
    uint32_t LCDCA_:1;         /*!< bit:     23  LCDCA APB Clock Enable             */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBAMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBAMASK_OFFSET           0x028        /**< \brief (PM_PBAMASK offset) PBA Mask */
#define PM_PBAMASK_RESETVALUE       _U(0x00000000); /**< \brief (PM_PBAMASK reset_value) PBA Mask */

#define PM_PBAMASK_IISC_Pos         0            /**< \brief (PM_PBAMASK) IISC APB Clock Enable */
#define PM_PBAMASK_IISC             (_U(0x1) << PM_PBAMASK_IISC_Pos)
#define PM_PBAMASK_SPI_Pos          1            /**< \brief (PM_PBAMASK) SPI APB Clock Enable */
#define PM_PBAMASK_SPI              (_U(0x1) << PM_PBAMASK_SPI_Pos)
#define PM_PBAMASK_TC0_Pos          2            /**< \brief (PM_PBAMASK) TC0 APB Clock Enable */
#define PM_PBAMASK_TC0              (_U(0x1) << PM_PBAMASK_TC0_Pos)
#define PM_PBAMASK_TC1_Pos          3            /**< \brief (PM_PBAMASK) TC1 APB Clock Enable */
#define PM_PBAMASK_TC1              (_U(0x1) << PM_PBAMASK_TC1_Pos)
#define PM_PBAMASK_TWIM0_Pos        4            /**< \brief (PM_PBAMASK) TWIM0 APB Clock Enable */
#define PM_PBAMASK_TWIM0            (_U(0x1) << PM_PBAMASK_TWIM0_Pos)
#define PM_PBAMASK_TWIS0_Pos        5            /**< \brief (PM_PBAMASK) TWIS0 APB Clock Enable */
#define PM_PBAMASK_TWIS0            (_U(0x1) << PM_PBAMASK_TWIS0_Pos)
#define PM_PBAMASK_TWIM1_Pos        6            /**< \brief (PM_PBAMASK) TWIM1 APB Clock Enable */
#define PM_PBAMASK_TWIM1            (_U(0x1) << PM_PBAMASK_TWIM1_Pos)
#define PM_PBAMASK_TWIS1_Pos        7            /**< \brief (PM_PBAMASK) TWIS1 APB Clock Enable */
#define PM_PBAMASK_TWIS1            (_U(0x1) << PM_PBAMASK_TWIS1_Pos)
#define PM_PBAMASK_USART0_Pos       8            /**< \brief (PM_PBAMASK) USART0 APB Clock Enable */
#define PM_PBAMASK_USART0           (_U(0x1) << PM_PBAMASK_USART0_Pos)
#define PM_PBAMASK_USART1_Pos       9            /**< \brief (PM_PBAMASK) USART1 APB Clock Enable */
#define PM_PBAMASK_USART1           (_U(0x1) << PM_PBAMASK_USART1_Pos)
#define PM_PBAMASK_USART2_Pos       10           /**< \brief (PM_PBAMASK) USART2 APB Clock Enable */
#define PM_PBAMASK_USART2           (_U(0x1) << PM_PBAMASK_USART2_Pos)
#define PM_PBAMASK_USART3_Pos       11           /**< \brief (PM_PBAMASK) USART3 APB Clock Enable */
#define PM_PBAMASK_USART3           (_U(0x1) << PM_PBAMASK_USART3_Pos)
#define PM_PBAMASK_ADCIFE_Pos       12           /**< \brief (PM_PBAMASK) ADCIFE APB Clock Enable */
#define PM_PBAMASK_ADCIFE           (_U(0x1) << PM_PBAMASK_ADCIFE_Pos)
#define PM_PBAMASK_DACC_Pos         13           /**< \brief (PM_PBAMASK) DACC APB Clock Enable */
#define PM_PBAMASK_DACC             (_U(0x1) << PM_PBAMASK_DACC_Pos)
#define PM_PBAMASK_ACIFC_Pos        14           /**< \brief (PM_PBAMASK) ACIFC APB Clock Enable */
#define PM_PBAMASK_ACIFC            (_U(0x1) << PM_PBAMASK_ACIFC_Pos)
#define PM_PBAMASK_GLOC_Pos         15           /**< \brief (PM_PBAMASK) GLOC APB Clock Enable */
#define PM_PBAMASK_GLOC             (_U(0x1) << PM_PBAMASK_GLOC_Pos)
#define PM_PBAMASK_ABDACB_Pos       16           /**< \brief (PM_PBAMASK) ABDACB APB Clock Enable */
#define PM_PBAMASK_ABDACB           (_U(0x1) << PM_PBAMASK_ABDACB_Pos)
#define PM_PBAMASK_TRNG_Pos         17           /**< \brief (PM_PBAMASK) TRNG APB Clock Enable */
#define PM_PBAMASK_TRNG             (_U(0x1) << PM_PBAMASK_TRNG_Pos)
#define PM_PBAMASK_PARC_Pos         18           /**< \brief (PM_PBAMASK) PARC APB Clock Enable */
#define PM_PBAMASK_PARC             (_U(0x1) << PM_PBAMASK_PARC_Pos)
#define PM_PBAMASK_CATB_Pos         19           /**< \brief (PM_PBAMASK) CATB APB Clock Enable */
#define PM_PBAMASK_CATB             (_U(0x1) << PM_PBAMASK_CATB_Pos)
#define PM_PBAMASK_TWIM2_Pos        21           /**< \brief (PM_PBAMASK) TWIM2 APB Clock Enable */
#define PM_PBAMASK_TWIM2            (_U(0x1) << PM_PBAMASK_TWIM2_Pos)
#define PM_PBAMASK_TWIM3_Pos        22           /**< \brief (PM_PBAMASK) TWIM3 APB Clock Enable */
#define PM_PBAMASK_TWIM3            (_U(0x1) << PM_PBAMASK_TWIM3_Pos)
#define PM_PBAMASK_LCDCA_Pos        23           /**< \brief (PM_PBAMASK) LCDCA APB Clock Enable */
#define PM_PBAMASK_LCDCA            (_U(0x1) << PM_PBAMASK_LCDCA_Pos)
#define PM_PBAMASK_MASK             _U(0x00EFFFFF) /**< \brief (PM_PBAMASK) MASK Register */

/* -------- PM_PBBMASK : (PM Offset: 0x02C) (R/W 32) PBB Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t HFLASHC_:1;       /*!< bit:      0  HFLASHC APB Clock Enable           */
    uint32_t HCACHE_:1;        /*!< bit:      1  HCACHE APB Clock Enable            */
    uint32_t HMATRIX_:1;       /*!< bit:      2  HMATRIX APB Clock Enable           */
    uint32_t PDCA_:1;          /*!< bit:      3  PDCA APB Clock Enable              */
    uint32_t CRCCU_:1;         /*!< bit:      4  CRCCU APB Clock Enable             */
    uint32_t USBC_:1;          /*!< bit:      5  USBC APB Clock Enable              */
    uint32_t PEVC_:1;          /*!< bit:      6  PEVC APB Clock Enable              */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBBMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBBMASK_OFFSET           0x02C        /**< \brief (PM_PBBMASK offset) PBB Mask */
#define PM_PBBMASK_RESETVALUE       _U(0x00000001); /**< \brief (PM_PBBMASK reset_value) PBB Mask */

