frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
#define PM_PBBMASK_HFLASHC_Pos      0            /**< \brief (PM_PBBMASK) HFLASHC APB Clock Enable */
#define PM_PBBMASK_HFLASHC          (_U(0x1) << PM_PBBMASK_HFLASHC_Pos)
#define PM_PBBMASK_HCACHE_Pos       1            /**< \brief (PM_PBBMASK) HCACHE APB Clock Enable */
#define PM_PBBMASK_HCACHE           (_U(0x1) << PM_PBBMASK_HCACHE_Pos)
#define PM_PBBMASK_HMATRIX_Pos      2            /**< \brief (PM_PBBMASK) HMATRIX APB Clock Enable */
#define PM_PBBMASK_HMATRIX          (_U(0x1) << PM_PBBMASK_HMATRIX_Pos)
#define PM_PBBMASK_PDCA_Pos         3            /**< \brief (PM_PBBMASK) PDCA APB Clock Enable */
#define PM_PBBMASK_PDCA             (_U(0x1) << PM_PBBMASK_PDCA_Pos)
#define PM_PBBMASK_CRCCU_Pos        4            /**< \brief (PM_PBBMASK) CRCCU APB Clock Enable */
#define PM_PBBMASK_CRCCU            (_U(0x1) << PM_PBBMASK_CRCCU_Pos)
#define PM_PBBMASK_USBC_Pos         5            /**< \brief (PM_PBBMASK) USBC APB Clock Enable */
#define PM_PBBMASK_USBC             (_U(0x1) << PM_PBBMASK_USBC_Pos)
#define PM_PBBMASK_PEVC_Pos         6            /**< \brief (PM_PBBMASK) PEVC APB Clock Enable */
#define PM_PBBMASK_PEVC             (_U(0x1) << PM_PBBMASK_PEVC_Pos)
#define PM_PBBMASK_MASK             _U(0x0000007F) /**< \brief (PM_PBBMASK) MASK Register */

/* -------- PM_PBCMASK : (PM Offset: 0x030) (R/W 32) PBC Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PM_:1;            /*!< bit:      0  PM APB Clock Enable                */
    uint32_t CHIPID_:1;        /*!< bit:      1  CHIPID APB Clock Enable            */
    uint32_t SCIF_:1;          /*!< bit:      2  SCIF APB Clock Enable              */
    uint32_t FREQM_:1;         /*!< bit:      3  FREQM APB Clock Enable             */
    uint32_t GPIO_:1;          /*!< bit:      4  GPIO APB Clock Enable              */
    uint32_t :27;              /*!< bit:  5..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBCMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBCMASK_OFFSET           0x030        /**< \brief (PM_PBCMASK offset) PBC Mask */
#define PM_PBCMASK_RESETVALUE       _U(0x0000001F); /**< \brief (PM_PBCMASK reset_value) PBC Mask */

#define PM_PBCMASK_PM_Pos           0            /**< \brief (PM_PBCMASK) PM APB Clock Enable */
#define PM_PBCMASK_PM               (_U(0x1) << PM_PBCMASK_PM_Pos)
#define PM_PBCMASK_CHIPID_Pos       1            /**< \brief (PM_PBCMASK) CHIPID APB Clock Enable */
#define PM_PBCMASK_CHIPID           (_U(0x1) << PM_PBCMASK_CHIPID_Pos)
#define PM_PBCMASK_SCIF_Pos         2            /**< \brief (PM_PBCMASK) SCIF APB Clock Enable */
#define PM_PBCMASK_SCIF             (_U(0x1) << PM_PBCMASK_SCIF_Pos)
#define PM_PBCMASK_FREQM_Pos        3            /**< \brief (PM_PBCMASK) FREQM APB Clock Enable */
#define PM_PBCMASK_FREQM            (_U(0x1) << PM_PBCMASK_FREQM_Pos)
#define PM_PBCMASK_GPIO_Pos         4            /**< \brief (PM_PBCMASK) GPIO APB Clock Enable */
#define PM_PBCMASK_GPIO             (_U(0x1) << PM_PBCMASK_GPIO_Pos)
#define PM_PBCMASK_MASK             _U(0x0000001F) /**< \brief (PM_PBCMASK) MASK Register */

/* -------- PM_PBDMASK : (PM Offset: 0x034) (R/W 32) PBD Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BPM_:1;           /*!< bit:      0  BPM APB Clock Enable               */
    uint32_t BSCIF_:1;         /*!< bit:      1  BSCIF APB Clock Enable             */
    uint32_t AST_:1;           /*!< bit:      2  AST APB Clock Enable               */
    uint32_t WDT_:1;           /*!< bit:      3  WDT APB Clock Enable               */
    uint32_t EIC_:1;           /*!< bit:      4  EIC APB Clock Enable               */
    uint32_t PICOUART_:1;      /*!< bit:      5  PICOUART APB Clock Enable          */
    uint32_t :26;              /*!< bit:  6..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBDMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PBDMASK_OFFSET           0x034        /**< \brief (PM_PBDMASK offset) PBD Mask */
#define PM_PBDMASK_RESETVALUE       _U(0x0000003F); /**< \brief (PM_PBDMASK reset_value) PBD Mask */

#define PM_PBDMASK_BPM_Pos          0            /**< \brief (PM_PBDMASK) BPM APB Clock Enable */
#define PM_PBDMASK_BPM              (_U(0x1) << PM_PBDMASK_BPM_Pos)
#define PM_PBDMASK_BSCIF_Pos        1            /**< \brief (PM_PBDMASK) BSCIF APB Clock Enable */
#define PM_PBDMASK_BSCIF            (_U(0x1) << PM_PBDMASK_BSCIF_Pos)
#define PM_PBDMASK_AST_Pos          2            /**< \brief (PM_PBDMASK) AST APB Clock Enable */
#define PM_PBDMASK_AST              (_U(0x1) << PM_PBDMASK_AST_Pos)
#define PM_PBDMASK_WDT_Pos          3            /**< \brief (PM_PBDMASK) WDT APB Clock Enable */
#define PM_PBDMASK_WDT              (_U(0x1) << PM_PBDMASK_WDT_Pos)
#define PM_PBDMASK_EIC_Pos          4            /**< \brief (PM_PBDMASK) EIC APB Clock Enable */
#define PM_PBDMASK_EIC              (_U(0x1) << PM_PBDMASK_EIC_Pos)
#define PM_PBDMASK_PICOUART_Pos     5            /**< \brief (PM_PBDMASK) PICOUART APB Clock Enable */
#define PM_PBDMASK_PICOUART         (_U(0x1) << PM_PBDMASK_PICOUART_Pos)
#define PM_PBDMASK_MASK             _U(0x0000003F) /**< \brief (PM_PBDMASK) MASK Register */

/* -------- PM_PBADIVMASK : (PM Offset: 0x040) (R/W 32) PBA Divided Clock Mask -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PBADIVMASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

