frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
#define PM_PBADIVMASK_OFFSET        0x040        /**< \brief (PM_PBADIVMASK offset) PBA Divided Clock Mask */
#define PM_PBADIVMASK_RESETVALUE    _U(0x00000000); /**< \brief (PM_PBADIVMASK reset_value) PBA Divided Clock Mask */
#define PM_PBADIVMASK_MASK          _U(0xFFFFFFFF) /**< \brief (PM_PBADIVMASK) MASK Register */

/* -------- PM_CFDCTRL : (PM Offset: 0x054) (R/W 32) Clock Failure Detector Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFDEN:1;          /*!< bit:      0  Clock Failure Detection Enable     */
    uint32_t :30;              /*!< bit:  1..30  Reserved                           */
    uint32_t SFV:1;            /*!< bit:     31  Store Final Value                  */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_CFDCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_CFDCTRL_OFFSET           0x054        /**< \brief (PM_CFDCTRL offset) Clock Failure Detector Control */
#define PM_CFDCTRL_RESETVALUE       _U(0x00000000); /**< \brief (PM_CFDCTRL reset_value) Clock Failure Detector Control */

#define PM_CFDCTRL_CFDEN_Pos        0            /**< \brief (PM_CFDCTRL) Clock Failure Detection Enable */
#define PM_CFDCTRL_CFDEN            (_U(0x1) << PM_CFDCTRL_CFDEN_Pos)
#define PM_CFDCTRL_SFV_Pos          31           /**< \brief (PM_CFDCTRL) Store Final Value */
#define PM_CFDCTRL_SFV              (_U(0x1) << PM_CFDCTRL_SFV_Pos)
#define PM_CFDCTRL_MASK             _U(0x80000001) /**< \brief (PM_CFDCTRL) MASK Register */

/* -------- PM_UNLOCK : (PM Offset: 0x058) ( /W 32) Unlock Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDR:10;          /*!< bit:  0.. 9  Unlock Address                     */
    uint32_t :14;              /*!< bit: 10..23  Reserved                           */
    uint32_t KEY:8;            /*!< bit: 24..31  Unlock Key                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_UNLOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_UNLOCK_OFFSET            0x058        /**< \brief (PM_UNLOCK offset) Unlock Register */
#define PM_UNLOCK_RESETVALUE        _U(0x00000000); /**< \brief (PM_UNLOCK reset_value) Unlock Register */

#define PM_UNLOCK_ADDR_Pos          0            /**< \brief (PM_UNLOCK) Unlock Address */
#define PM_UNLOCK_ADDR_Msk          (_U(0x3FF) << PM_UNLOCK_ADDR_Pos)
#define PM_UNLOCK_ADDR(value)       (PM_UNLOCK_ADDR_Msk & ((value) << PM_UNLOCK_ADDR_Pos))
#define PM_UNLOCK_KEY_Pos           24           /**< \brief (PM_UNLOCK) Unlock Key */
#define PM_UNLOCK_KEY_Msk           (_U(0xFF) << PM_UNLOCK_KEY_Pos)
#define PM_UNLOCK_KEY(value)        (PM_UNLOCK_KEY_Msk & ((value) << PM_UNLOCK_KEY_Pos))
#define PM_UNLOCK_MASK              _U(0xFF0003FF) /**< \brief (PM_UNLOCK) MASK Register */

/* -------- PM_IER : (PM Offset: 0x0C0) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFD:1;            /*!< bit:      0  Clock Failure Detected Interrupt Enable */
    uint32_t :4;               /*!< bit:  1.. 4  Reserved                           */
    uint32_t CKRDY:1;          /*!< bit:      5  Clock Ready Interrupt Enable       */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t WAKE:1;           /*!< bit:      8  Wake up Interrupt Enable           */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error Interrupt Enable      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_IER_OFFSET               0x0C0        /**< \brief (PM_IER offset) Interrupt Enable Register */
#define PM_IER_RESETVALUE           _U(0x00000000); /**< \brief (PM_IER reset_value) Interrupt Enable Register */

#define PM_IER_CFD_Pos              0            /**< \brief (PM_IER) Clock Failure Detected Interrupt Enable */
#define PM_IER_CFD                  (_U(0x1) << PM_IER_CFD_Pos)
#define PM_IER_CKRDY_Pos            5            /**< \brief (PM_IER) Clock Ready Interrupt Enable */
#define PM_IER_CKRDY                (_U(0x1) << PM_IER_CKRDY_Pos)
#define PM_IER_WAKE_Pos             8            /**< \brief (PM_IER) Wake up Interrupt Enable */
#define PM_IER_WAKE                 (_U(0x1) << PM_IER_WAKE_Pos)
#define   PM_IER_WAKE_0_Val               _U(0x0)   /**< \brief (PM_IER) No effect */
#define   PM_IER_WAKE_1_Val               _U(0x1)   /**< \brief (PM_IER) Disable Interrupt. */
#define PM_IER_WAKE_0               (PM_IER_WAKE_0_Val             << PM_IER_WAKE_Pos)
#define PM_IER_WAKE_1               (PM_IER_WAKE_1_Val             << PM_IER_WAKE_Pos)
#define PM_IER_AE_Pos               31           /**< \brief (PM_IER) Access Error Interrupt Enable */
#define PM_IER_AE                   (_U(0x1) << PM_IER_AE_Pos)
#define PM_IER_MASK                 _U(0x80000121) /**< \brief (PM_IER) MASK Register */

/* -------- PM_IDR : (PM Offset: 0x0C4) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFD:1;            /*!< bit:      0  Clock Failure Detected Interrupt Disable */
    uint32_t :4;               /*!< bit:  1.. 4  Reserved                           */
    uint32_t CKRDY:1;          /*!< bit:      5  Clock Ready Interrupt Disable      */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t WAKE:1;           /*!< bit:      8  Wake up Interrupt Disable          */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error Interrupt Disable     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_IDR_OFFSET               0x0C4        /**< \brief (PM_IDR offset) Interrupt Disable Register */
#define PM_IDR_RESETVALUE           _U(0x00000000); /**< \brief (PM_IDR reset_value) Interrupt Disable Register */

#define PM_IDR_CFD_Pos              0            /**< \brief (PM_IDR) Clock Failure Detected Interrupt Disable */
#define PM_IDR_CFD                  (_U(0x1) << PM_IDR_CFD_Pos)
#define PM_IDR_CKRDY_Pos            5            /**< \brief (PM_IDR) Clock Ready Interrupt Disable */
#define PM_IDR_CKRDY                (_U(0x1) << PM_IDR_CKRDY_Pos)
#define PM_IDR_WAKE_Pos             8            /**< \brief (PM_IDR) Wake up Interrupt Disable */
#define PM_IDR_WAKE                 (_U(0x1) << PM_IDR_WAKE_Pos)
#define   PM_IDR_WAKE_0_Val               _U(0x0)   /**< \brief (PM_IDR) No effect */
#define   PM_IDR_WAKE_1_Val               _U(0x1)   /**< \brief (PM_IDR) Disable Interrupt. */
#define PM_IDR_WAKE_0               (PM_IDR_WAKE_0_Val             << PM_IDR_WAKE_Pos)
#define PM_IDR_WAKE_1               (PM_IDR_WAKE_1_Val             << PM_IDR_WAKE_Pos)
#define PM_IDR_AE_Pos               31           /**< \brief (PM_IDR) Access Error Interrupt Disable */
#define PM_IDR_AE                   (_U(0x1) << PM_IDR_AE_Pos)
#define PM_IDR_MASK                 _U(0x80000121) /**< \brief (PM_IDR) MASK Register */

/* -------- PM_IMR : (PM Offset: 0x0C8) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFD:1;            /*!< bit:      0  Clock Failure Detected Interrupt Mask */
    uint32_t :4;               /*!< bit:  1.. 4  Reserved                           */
    uint32_t CKRDY:1;          /*!< bit:      5  Clock Ready Interrupt Mask         */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t WAKE:1;           /*!< bit:      8  Wake up Interrupt Mask             */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error Interrupt Mask        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_IMR_OFFSET               0x0C8        /**< \brief (PM_IMR offset) Interrupt Mask Register */
#define PM_IMR_RESETVALUE           _U(0x00000000); /**< \brief (PM_IMR reset_value) Interrupt Mask Register */

#define PM_IMR_CFD_Pos              0            /**< \brief (PM_IMR) Clock Failure Detected Interrupt Mask */
#define PM_IMR_CFD                  (_U(0x1) << PM_IMR_CFD_Pos)
#define PM_IMR_CKRDY_Pos            5            /**< \brief (PM_IMR) Clock Ready Interrupt Mask */
#define PM_IMR_CKRDY                (_U(0x1) << PM_IMR_CKRDY_Pos)
#define PM_IMR_WAKE_Pos             8            /**< \brief (PM_IMR) Wake up Interrupt Mask */
#define PM_IMR_WAKE                 (_U(0x1) << PM_IMR_WAKE_Pos)
#define   PM_IMR_WAKE_0_Val               _U(0x0)   /**< \brief (PM_IMR) No effect */
#define   PM_IMR_WAKE_1_Val               _U(0x1)   /**< \brief (PM_IMR) Disable Interrupt. */
#define PM_IMR_WAKE_0               (PM_IMR_WAKE_0_Val             << PM_IMR_WAKE_Pos)
#define PM_IMR_WAKE_1               (PM_IMR_WAKE_1_Val             << PM_IMR_WAKE_Pos)
#define PM_IMR_AE_Pos               31           /**< \brief (PM_IMR) Access Error Interrupt Mask */
#define PM_IMR_AE                   (_U(0x1) << PM_IMR_AE_Pos)
#define PM_IMR_MASK                 _U(0x80000121) /**< \brief (PM_IMR) MASK Register */

