frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
/* -------- PM_ISR : (PM Offset: 0x0CC) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFD:1;            /*!< bit:      0  Clock Failure Detected Interrupt Status */
    uint32_t :4;               /*!< bit:  1.. 4  Reserved                           */
    uint32_t CKRDY:1;          /*!< bit:      5  Clock Ready Interrupt Status       */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t WAKE:1;           /*!< bit:      8  Wake up Interrupt Status           */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error Interrupt Status      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_ISR_OFFSET               0x0CC        /**< \brief (PM_ISR offset) Interrupt Status Register */
#define PM_ISR_RESETVALUE           _U(0x00000000); /**< \brief (PM_ISR reset_value) Interrupt Status Register */

#define PM_ISR_CFD_Pos              0            /**< \brief (PM_ISR) Clock Failure Detected Interrupt Status */
#define PM_ISR_CFD                  (_U(0x1) << PM_ISR_CFD_Pos)
#define PM_ISR_CKRDY_Pos            5            /**< \brief (PM_ISR) Clock Ready Interrupt Status */
#define PM_ISR_CKRDY                (_U(0x1) << PM_ISR_CKRDY_Pos)
#define PM_ISR_WAKE_Pos             8            /**< \brief (PM_ISR) Wake up Interrupt Status */
#define PM_ISR_WAKE                 (_U(0x1) << PM_ISR_WAKE_Pos)
#define   PM_ISR_WAKE_0_Val               _U(0x0)   /**< \brief (PM_ISR) No effect */
#define   PM_ISR_WAKE_1_Val               _U(0x1)   /**< \brief (PM_ISR) Disable Interrupt. */
#define PM_ISR_WAKE_0               (PM_ISR_WAKE_0_Val             << PM_ISR_WAKE_Pos)
#define PM_ISR_WAKE_1               (PM_ISR_WAKE_1_Val             << PM_ISR_WAKE_Pos)
#define PM_ISR_AE_Pos               31           /**< \brief (PM_ISR) Access Error Interrupt Status */
#define PM_ISR_AE                   (_U(0x1) << PM_ISR_AE_Pos)
#define PM_ISR_MASK                 _U(0x80000121) /**< \brief (PM_ISR) MASK Register */

/* -------- PM_ICR : (PM Offset: 0x0D0) ( /W 32) Interrupt Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFD:1;            /*!< bit:      0  Clock Failure Detected Interrupt Status Clear */
    uint32_t :4;               /*!< bit:  1.. 4  Reserved                           */
    uint32_t CKRDY:1;          /*!< bit:      5  Clock Ready Interrupt Status Clear */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t WAKE:1;           /*!< bit:      8  Wake up Interrupt Status Clear     */
    uint32_t :22;              /*!< bit:  9..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error Interrupt Status Clear */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_ICR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_ICR_OFFSET               0x0D0        /**< \brief (PM_ICR offset) Interrupt Clear Register */
#define PM_ICR_RESETVALUE           _U(0x00000000); /**< \brief (PM_ICR reset_value) Interrupt Clear Register */

#define PM_ICR_CFD_Pos              0            /**< \brief (PM_ICR) Clock Failure Detected Interrupt Status Clear */
#define PM_ICR_CFD                  (_U(0x1) << PM_ICR_CFD_Pos)
#define PM_ICR_CKRDY_Pos            5            /**< \brief (PM_ICR) Clock Ready Interrupt Status Clear */
#define PM_ICR_CKRDY                (_U(0x1) << PM_ICR_CKRDY_Pos)
#define PM_ICR_WAKE_Pos             8            /**< \brief (PM_ICR) Wake up Interrupt Status Clear */
#define PM_ICR_WAKE                 (_U(0x1) << PM_ICR_WAKE_Pos)
#define PM_ICR_AE_Pos               31           /**< \brief (PM_ICR) Access Error Interrupt Status Clear */
#define PM_ICR_AE                   (_U(0x1) << PM_ICR_AE_Pos)
#define PM_ICR_MASK                 _U(0x80000121) /**< \brief (PM_ICR) MASK Register */

/* -------- PM_SR : (PM Offset: 0x0D4) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CFD:1;            /*!< bit:      0  Clock Failure Detected             */
    uint32_t OCP:1;            /*!< bit:      1  Over Clock Detected                */
    uint32_t :3;               /*!< bit:  2.. 4  Reserved                           */
    uint32_t CKRDY:1;          /*!< bit:      5  Clock Ready                        */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t WAKE:1;           /*!< bit:      8  Wake up                            */
    uint32_t :19;              /*!< bit:  9..27  Reserved                           */
    uint32_t PERRDY:1;         /*!< bit:     28  Peripheral Ready                   */
    uint32_t :2;               /*!< bit: 29..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_SR_OFFSET                0x0D4        /**< \brief (PM_SR offset) Status Register */
#define PM_SR_RESETVALUE            _U(0x00000000); /**< \brief (PM_SR reset_value) Status Register */

#define PM_SR_CFD_Pos               0            /**< \brief (PM_SR) Clock Failure Detected */
#define PM_SR_CFD                   (_U(0x1) << PM_SR_CFD_Pos)
#define PM_SR_OCP_Pos               1            /**< \brief (PM_SR) Over Clock Detected */
#define PM_SR_OCP                   (_U(0x1) << PM_SR_OCP_Pos)
#define PM_SR_CKRDY_Pos             5            /**< \brief (PM_SR) Clock Ready */
#define PM_SR_CKRDY                 (_U(0x1) << PM_SR_CKRDY_Pos)
#define PM_SR_WAKE_Pos              8            /**< \brief (PM_SR) Wake up */
#define PM_SR_WAKE                  (_U(0x1) << PM_SR_WAKE_Pos)
#define   PM_SR_WAKE_0_Val                _U(0x0)   /**< \brief (PM_SR) No effect */
#define   PM_SR_WAKE_1_Val                _U(0x1)   /**< \brief (PM_SR) Disable Interrupt. */
#define PM_SR_WAKE_0                (PM_SR_WAKE_0_Val              << PM_SR_WAKE_Pos)
#define PM_SR_WAKE_1                (PM_SR_WAKE_1_Val              << PM_SR_WAKE_Pos)
#define PM_SR_PERRDY_Pos            28           /**< \brief (PM_SR) Peripheral Ready */
#define PM_SR_PERRDY                (_U(0x1) << PM_SR_PERRDY_Pos)
#define PM_SR_AE_Pos                31           /**< \brief (PM_SR) Access Error */
#define PM_SR_AE                    (_U(0x1) << PM_SR_AE_Pos)
#define PM_SR_MASK                  _U(0x90000123) /**< \brief (PM_SR) MASK Register */

/* -------- PM_PPCR : (PM Offset: 0x160) (R/W 32) Peripheral Power Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RSTPUN:1;         /*!< bit:      0  Reset Pullup                       */
    uint32_t CATBRCMASK:1;     /*!< bit:      1  CAT Request Clock Mask             */
    uint32_t ACIFCRCMASK:1;    /*!< bit:      2  ACIFC Request Clock Mask           */
    uint32_t ASTRCMASK:1;      /*!< bit:      3  AST Request Clock Mask             */
    uint32_t TWIS0RCMASK:1;    /*!< bit:      4  TWIS0 Request Clock Mask           */
    uint32_t TWIS1RCMASK:1;    /*!< bit:      5  TWIS1 Request Clock Mask           */
    uint32_t PEVCRCMASK:1;     /*!< bit:      6  PEVC Request Clock Mask            */
    uint32_t ADCIFERCMASK:1;   /*!< bit:      7  ADCIFE Request Clock Mask          */
    uint32_t VREGRCMASK:1;     /*!< bit:      8  VREG Request Clock Mask            */
    uint32_t FWBGREF:1;        /*!< bit:      9  Flash Wait BGREF                   */
    uint32_t FWBOD18:1;        /*!< bit:     10  Flash Wait BOD18                   */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_PPCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_PPCR_OFFSET              0x160        /**< \brief (PM_PPCR offset) Peripheral Power Control Register */
#define PM_PPCR_RESETVALUE          _U(0x000001FE); /**< \brief (PM_PPCR reset_value) Peripheral Power Control Register */

