frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
#define PM_PPCR_RSTPUN_Pos          0            /**< \brief (PM_PPCR) Reset Pullup */
#define PM_PPCR_RSTPUN              (_U(0x1) << PM_PPCR_RSTPUN_Pos)
#define PM_PPCR_CATBRCMASK_Pos      1            /**< \brief (PM_PPCR) CAT Request Clock Mask */
#define PM_PPCR_CATBRCMASK          (_U(0x1) << PM_PPCR_CATBRCMASK_Pos)
#define PM_PPCR_ACIFCRCMASK_Pos     2            /**< \brief (PM_PPCR) ACIFC Request Clock Mask */
#define PM_PPCR_ACIFCRCMASK         (_U(0x1) << PM_PPCR_ACIFCRCMASK_Pos)
#define PM_PPCR_ASTRCMASK_Pos       3            /**< \brief (PM_PPCR) AST Request Clock Mask */
#define PM_PPCR_ASTRCMASK           (_U(0x1) << PM_PPCR_ASTRCMASK_Pos)
#define PM_PPCR_TWIS0RCMASK_Pos     4            /**< \brief (PM_PPCR) TWIS0 Request Clock Mask */
#define PM_PPCR_TWIS0RCMASK         (_U(0x1) << PM_PPCR_TWIS0RCMASK_Pos)
#define PM_PPCR_TWIS1RCMASK_Pos     5            /**< \brief (PM_PPCR) TWIS1 Request Clock Mask */
#define PM_PPCR_TWIS1RCMASK         (_U(0x1) << PM_PPCR_TWIS1RCMASK_Pos)
#define PM_PPCR_PEVCRCMASK_Pos      6            /**< \brief (PM_PPCR) PEVC Request Clock Mask */
#define PM_PPCR_PEVCRCMASK          (_U(0x1) << PM_PPCR_PEVCRCMASK_Pos)
#define PM_PPCR_ADCIFERCMASK_Pos    7            /**< \brief (PM_PPCR) ADCIFE Request Clock Mask */
#define PM_PPCR_ADCIFERCMASK        (_U(0x1) << PM_PPCR_ADCIFERCMASK_Pos)
#define PM_PPCR_VREGRCMASK_Pos      8            /**< \brief (PM_PPCR) VREG Request Clock Mask */
#define PM_PPCR_VREGRCMASK          (_U(0x1) << PM_PPCR_VREGRCMASK_Pos)
#define PM_PPCR_FWBGREF_Pos         9            /**< \brief (PM_PPCR) Flash Wait BGREF */
#define PM_PPCR_FWBGREF             (_U(0x1) << PM_PPCR_FWBGREF_Pos)
#define PM_PPCR_FWBOD18_Pos         10           /**< \brief (PM_PPCR) Flash Wait BOD18 */
#define PM_PPCR_FWBOD18             (_U(0x1) << PM_PPCR_FWBOD18_Pos)
#define PM_PPCR_MASK                _U(0x000007FF) /**< \brief (PM_PPCR) MASK Register */

/* -------- PM_RCAUSE : (PM Offset: 0x180) (R/  32) Reset Cause Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t POR:1;            /*!< bit:      0  Power-on Reset                     */
    uint32_t BOD:1;            /*!< bit:      1  Brown-out Reset                    */
    uint32_t EXT:1;            /*!< bit:      2  External Reset Pin                 */
    uint32_t WDT:1;            /*!< bit:      3  Watchdog Reset                     */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t OCDRST:1;         /*!< bit:      8  OCD Reset                          */
    uint32_t :1;               /*!< bit:      9  Reserved                           */
    uint32_t POR33:1;          /*!< bit:     10  Power-on Reset                     */
    uint32_t :2;               /*!< bit: 11..12  Reserved                           */
    uint32_t BOD33:1;          /*!< bit:     13  Brown-out 3.3V Reset               */
    uint32_t :18;              /*!< bit: 14..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_RCAUSE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_RCAUSE_OFFSET            0x180        /**< \brief (PM_RCAUSE offset) Reset Cause Register */
#define PM_RCAUSE_RESETVALUE        _U(0x00000000); /**< \brief (PM_RCAUSE reset_value) Reset Cause Register */

#define PM_RCAUSE_POR_Pos           0            /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_POR               (_U(0x1) << PM_RCAUSE_POR_Pos)
#define PM_RCAUSE_BOD_Pos           1            /**< \brief (PM_RCAUSE) Brown-out Reset */
#define PM_RCAUSE_BOD               (_U(0x1) << PM_RCAUSE_BOD_Pos)
#define PM_RCAUSE_EXT_Pos           2            /**< \brief (PM_RCAUSE) External Reset Pin */
#define PM_RCAUSE_EXT               (_U(0x1) << PM_RCAUSE_EXT_Pos)
#define PM_RCAUSE_WDT_Pos           3            /**< \brief (PM_RCAUSE) Watchdog Reset */
#define PM_RCAUSE_WDT               (_U(0x1) << PM_RCAUSE_WDT_Pos)
#define PM_RCAUSE_OCDRST_Pos        8            /**< \brief (PM_RCAUSE) OCD Reset */
#define PM_RCAUSE_OCDRST            (_U(0x1) << PM_RCAUSE_OCDRST_Pos)
#define PM_RCAUSE_POR33_Pos         10           /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_POR33             (_U(0x1) << PM_RCAUSE_POR33_Pos)
#define PM_RCAUSE_BOD33_Pos         13           /**< \brief (PM_RCAUSE) Brown-out 3.3V Reset */
#define PM_RCAUSE_BOD33             (_U(0x1) << PM_RCAUSE_BOD33_Pos)
#define PM_RCAUSE_MASK              _U(0x0000250F) /**< \brief (PM_RCAUSE) MASK Register */

/* -------- PM_WCAUSE : (PM Offset: 0x184) (R/  32) Wake Cause Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TWI_SLAVE_0:1;    /*!< bit:      0  Two-wire Slave Interface 0         */
    uint32_t TWI_SLAVE_1:1;    /*!< bit:      1  Two-wire Slave Interface 1         */
    uint32_t USBC:1;           /*!< bit:      2  USB Device and Embedded Host Interface */
    uint32_t PSOK:1;           /*!< bit:      3  Power Scaling OK                   */
    uint32_t BOD18_IRQ:1;      /*!< bit:      4  BOD18 Interrupt                    */
    uint32_t BOD33_IRQ:1;      /*!< bit:      5  BOD33 Interrupt                    */
    uint32_t PICOUART:1;       /*!< bit:      6  Picopower UART                     */
    uint32_t LCDCA:1;          /*!< bit:      7  LCD Controller                     */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t EIC:1;            /*!< bit:     16  External Interrupt Controller      */
    uint32_t AST:1;            /*!< bit:     17  Asynchronous Timer                 */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_WCAUSE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

