frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/pm.h
#define PM_WCAUSE_OFFSET            0x184        /**< \brief (PM_WCAUSE offset) Wake Cause Register */
#define PM_WCAUSE_RESETVALUE        _U(0x00000000); /**< \brief (PM_WCAUSE reset_value) Wake Cause Register */

#define PM_WCAUSE_TWI_SLAVE_0_Pos   0            /**< \brief (PM_WCAUSE) Two-wire Slave Interface 0 */
#define PM_WCAUSE_TWI_SLAVE_0       (_U(0x1) << PM_WCAUSE_TWI_SLAVE_0_Pos)
#define PM_WCAUSE_TWI_SLAVE_1_Pos   1            /**< \brief (PM_WCAUSE) Two-wire Slave Interface 1 */
#define PM_WCAUSE_TWI_SLAVE_1       (_U(0x1) << PM_WCAUSE_TWI_SLAVE_1_Pos)
#define PM_WCAUSE_USBC_Pos          2            /**< \brief (PM_WCAUSE) USB Device and Embedded Host Interface */
#define PM_WCAUSE_USBC              (_U(0x1) << PM_WCAUSE_USBC_Pos)
#define PM_WCAUSE_PSOK_Pos          3            /**< \brief (PM_WCAUSE) Power Scaling OK */
#define PM_WCAUSE_PSOK              (_U(0x1) << PM_WCAUSE_PSOK_Pos)
#define PM_WCAUSE_BOD18_IRQ_Pos     4            /**< \brief (PM_WCAUSE) BOD18 Interrupt */
#define PM_WCAUSE_BOD18_IRQ         (_U(0x1) << PM_WCAUSE_BOD18_IRQ_Pos)
#define PM_WCAUSE_BOD33_IRQ_Pos     5            /**< \brief (PM_WCAUSE) BOD33 Interrupt */
#define PM_WCAUSE_BOD33_IRQ         (_U(0x1) << PM_WCAUSE_BOD33_IRQ_Pos)
#define PM_WCAUSE_PICOUART_Pos      6            /**< \brief (PM_WCAUSE) Picopower UART */
#define PM_WCAUSE_PICOUART          (_U(0x1) << PM_WCAUSE_PICOUART_Pos)
#define PM_WCAUSE_LCDCA_Pos         7            /**< \brief (PM_WCAUSE) LCD Controller */
#define PM_WCAUSE_LCDCA             (_U(0x1) << PM_WCAUSE_LCDCA_Pos)
#define PM_WCAUSE_EIC_Pos           16           /**< \brief (PM_WCAUSE) External Interrupt Controller */
#define PM_WCAUSE_EIC               (_U(0x1) << PM_WCAUSE_EIC_Pos)
#define PM_WCAUSE_AST_Pos           17           /**< \brief (PM_WCAUSE) Asynchronous Timer */
#define PM_WCAUSE_AST               (_U(0x1) << PM_WCAUSE_AST_Pos)
#define PM_WCAUSE_MASK              _U(0x000300FF) /**< \brief (PM_WCAUSE) MASK Register */

/* -------- PM_AWEN : (PM Offset: 0x188) (R/W 32) Asynchronous Wake Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t AWEN:32;          /*!< bit:  0..31  Asynchronous Wake Up               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_AWEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_AWEN_OFFSET              0x188        /**< \brief (PM_AWEN offset) Asynchronous Wake Enable */
#define PM_AWEN_RESETVALUE          _U(0x00000000); /**< \brief (PM_AWEN reset_value) Asynchronous Wake Enable */

#define PM_AWEN_AWEN_Pos            0            /**< \brief (PM_AWEN) Asynchronous Wake Up */
#define PM_AWEN_AWEN_Msk            (_U(0xFFFFFFFF) << PM_AWEN_AWEN_Pos)
#define PM_AWEN_AWEN(value)         (PM_AWEN_AWEN_Msk & ((value) << PM_AWEN_AWEN_Pos))
#define PM_AWEN_MASK                _U(0xFFFFFFFF) /**< \brief (PM_AWEN) MASK Register */

/* -------- PM_OBS : (PM Offset: 0x190) (R/W 32) Obsvervability -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} PM_OBS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_OBS_OFFSET               0x190        /**< \brief (PM_OBS offset) Obsvervability */
#define PM_OBS_RESETVALUE           _U(0x00000000); /**< \brief (PM_OBS reset_value) Obsvervability */

#define PM_OBS_MASK                 _U(0x00000000) /**< \brief (PM_OBS) MASK Register */

/* -------- PM_FASTSLEEP : (PM Offset: 0x194) (R/W 32) Fast Sleep Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC:1;            /*!< bit:      0  Oscillator                         */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t PLL:1;            /*!< bit:      8  PLL                                */
    uint32_t :7;               /*!< bit:  9..15  Reserved                           */
    uint32_t FASTRCOSC:5;      /*!< bit: 16..20  RC80 or FLO                        */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t DFLL:1;           /*!< bit:     24  DFLL                               */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_FASTSLEEP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_FASTSLEEP_OFFSET         0x194        /**< \brief (PM_FASTSLEEP offset) Fast Sleep Register */
#define PM_FASTSLEEP_RESETVALUE     _U(0x00000000); /**< \brief (PM_FASTSLEEP reset_value) Fast Sleep Register */

#define PM_FASTSLEEP_OSC_Pos        0            /**< \brief (PM_FASTSLEEP) Oscillator */
#define PM_FASTSLEEP_OSC            (_U(0x1) << PM_FASTSLEEP_OSC_Pos)
#define PM_FASTSLEEP_PLL_Pos        8            /**< \brief (PM_FASTSLEEP) PLL */
#define PM_FASTSLEEP_PLL            (_U(0x1) << PM_FASTSLEEP_PLL_Pos)
#define PM_FASTSLEEP_FASTRCOSC_Pos  16           /**< \brief (PM_FASTSLEEP) RC80 or FLO */
#define PM_FASTSLEEP_FASTRCOSC_Msk  (_U(0x1F) << PM_FASTSLEEP_FASTRCOSC_Pos)
#define PM_FASTSLEEP_FASTRCOSC(value) (PM_FASTSLEEP_FASTRCOSC_Msk & ((value) << PM_FASTSLEEP_FASTRCOSC_Pos))
#define PM_FASTSLEEP_DFLL_Pos       24           /**< \brief (PM_FASTSLEEP) DFLL */
#define PM_FASTSLEEP_DFLL           (_U(0x1) << PM_FASTSLEEP_DFLL_Pos)
#define PM_FASTSLEEP_MASK           _U(0x011F0101) /**< \brief (PM_FASTSLEEP) MASK Register */

/* -------- PM_CONFIG : (PM Offset: 0x3F8) (R/  32) Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PBA:1;            /*!< bit:      0  APBA Implemented                   */
    uint32_t PBB:1;            /*!< bit:      1  APBB Implemented                   */
    uint32_t PBC:1;            /*!< bit:      2  APBC Implemented                   */
    uint32_t PBD:1;            /*!< bit:      3  APBD Implemented                   */
    uint32_t :3;               /*!< bit:  4.. 6  Reserved                           */
    uint32_t HSBPEVC:1;        /*!< bit:      7  HSB PEVC Clock Implemented         */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_CONFIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_CONFIG_OFFSET            0x3F8        /**< \brief (PM_CONFIG offset) Configuration Register */
#define PM_CONFIG_RESETVALUE        _U(0x0000000F); /**< \brief (PM_CONFIG reset_value) Configuration Register */

#define PM_CONFIG_PBA_Pos           0            /**< \brief (PM_CONFIG) APBA Implemented */
#define PM_CONFIG_PBA               (_U(0x1) << PM_CONFIG_PBA_Pos)
#define PM_CONFIG_PBB_Pos           1            /**< \brief (PM_CONFIG) APBB Implemented */
#define PM_CONFIG_PBB               (_U(0x1) << PM_CONFIG_PBB_Pos)
#define PM_CONFIG_PBC_Pos           2            /**< \brief (PM_CONFIG) APBC Implemented */
#define PM_CONFIG_PBC               (_U(0x1) << PM_CONFIG_PBC_Pos)
#define PM_CONFIG_PBD_Pos           3            /**< \brief (PM_CONFIG) APBD Implemented */
#define PM_CONFIG_PBD               (_U(0x1) << PM_CONFIG_PBD_Pos)
#define PM_CONFIG_HSBPEVC_Pos       7            /**< \brief (PM_CONFIG) HSB PEVC Clock Implemented */
#define PM_CONFIG_HSBPEVC           (_U(0x1) << PM_CONFIG_HSBPEVC_Pos)
#define PM_CONFIG_MASK              _U(0x0000008F) /**< \brief (PM_CONFIG) MASK Register */

/* -------- PM_VERSION : (PM Offset: 0x3FC) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PM_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PM_VERSION_OFFSET           0x3FC        /**< \brief (PM_VERSION offset) Version Register */
#define PM_VERSION_RESETVALUE       _U(0x00000441); /**< \brief (PM_VERSION reset_value) Version Register */

#define PM_VERSION_VERSION_Pos      0            /**< \brief (PM_VERSION) Version number */
#define PM_VERSION_VERSION_Msk      (_U(0xFFF) << PM_VERSION_VERSION_Pos)
#define PM_VERSION_VERSION(value)   (PM_VERSION_VERSION_Msk & ((value) << PM_VERSION_VERSION_Pos))
#define PM_VERSION_VARIANT_Pos      16           /**< \brief (PM_VERSION) Variant number */
#define PM_VERSION_VARIANT_Msk      (_U(0xF) << PM_VERSION_VARIANT_Pos)
#define PM_VERSION_VARIANT(value)   (PM_VERSION_VARIANT_Msk & ((value) << PM_VERSION_VARIANT_Pos))
#define PM_VERSION_MASK             _U(0x000F0FFF) /**< \brief (PM_VERSION) MASK Register */

/** \brief PM hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO PM_MCCTRL_Type            MCCTRL;      /**< \brief Offset: 0x000 (R/W 32) Main Clock Control */
  __IO PM_CPUSEL_Type            CPUSEL;      /**< \brief Offset: 0x004 (R/W 32) CPU Clock Select */
       RoReg8                    Reserved1[0x4];
  __IO PM_PBASEL_Type            PBASEL;      /**< \brief Offset: 0x00C (R/W 32) PBA Clock Select */
  __IO PM_PBBSEL_Type            PBBSEL;      /**< \brief Offset: 0x010 (R/W 32) PBB Clock Select */
  __IO PM_PBCSEL_Type            PBCSEL;      /**< \brief Offset: 0x014 (R/W 32) PBC Clock Select */
  __IO PM_PBDSEL_Type            PBDSEL;      /**< \brief Offset: 0x018 (R/W 32) PBD Clock Select */
       RoReg8                    Reserved2[0x4];
  __IO PM_CPUMASK_Type           CPUMASK;     /**< \brief Offset: 0x020 (R/W 32) CPU Mask */
  __IO PM_HSBMASK_Type           HSBMASK;     /**< \brief Offset: 0x024 (R/W 32) HSB Mask */
  __IO PM_PBAMASK_Type           PBAMASK;     /**< \brief Offset: 0x028 (R/W 32) PBA Mask */
  __IO PM_PBBMASK_Type           PBBMASK;     /**< \brief Offset: 0x02C (R/W 32) PBB Mask */
  __IO PM_PBCMASK_Type           PBCMASK;     /**< \brief Offset: 0x030 (R/W 32) PBC Mask */
  __IO PM_PBDMASK_Type           PBDMASK;     /**< \brief Offset: 0x034 (R/W 32) PBD Mask */
       RoReg8                    Reserved3[0x8];
  __IO PM_PBADIVMASK_Type        PBADIVMASK;  /**< \brief Offset: 0x040 (R/W 32) PBA Divided Clock Mask */
       RoReg8                    Reserved4[0x10];
  __IO PM_CFDCTRL_Type           CFDCTRL;     /**< \brief Offset: 0x054 (R/W 32) Clock Failure Detector Control */
  __O  PM_UNLOCK_Type            UNLOCK;      /**< \brief Offset: 0x058 ( /W 32) Unlock Register */
       RoReg8                    Reserved5[0x64];
  __O  PM_IER_Type               IER;         /**< \brief Offset: 0x0C0 ( /W 32) Interrupt Enable Register */
  __O  PM_IDR_Type               IDR;         /**< \brief Offset: 0x0C4 ( /W 32) Interrupt Disable Register */
  __I  PM_IMR_Type               IMR;         /**< \brief Offset: 0x0C8 (R/  32) Interrupt Mask Register */
  __I  PM_ISR_Type               ISR;         /**< \brief Offset: 0x0CC (R/  32) Interrupt Status Register */
  __O  PM_ICR_Type               ICR;         /**< \brief Offset: 0x0D0 ( /W 32) Interrupt Clear Register */
  __I  PM_SR_Type                SR;          /**< \brief Offset: 0x0D4 (R/  32) Status Register */
       RoReg8                    Reserved6[0x88];
  __IO PM_PPCR_Type              PPCR;        /**< \brief Offset: 0x160 (R/W 32) Peripheral Power Control Register */
       RoReg8                    Reserved7[0x1C];
  __I  PM_RCAUSE_Type            RCAUSE;      /**< \brief Offset: 0x180 (R/  32) Reset Cause Register */
  __I  PM_WCAUSE_Type            WCAUSE;      /**< \brief Offset: 0x184 (R/  32) Wake Cause Register */
  __IO PM_AWEN_Type              AWEN;        /**< \brief Offset: 0x188 (R/W 32) Asynchronous Wake Enable */
       RoReg8                    Reserved8[0x4];
  __IO PM_OBS_Type               OBS;         /**< \brief Offset: 0x190 (R/W 32) Obsvervability */
  __IO PM_FASTSLEEP_Type         FASTSLEEP;   /**< \brief Offset: 0x194 (R/W 32) Fast Sleep Register */
       RoReg8                    Reserved9[0x260];
  __I  PM_CONFIG_Type            CONFIG;      /**< \brief Offset: 0x3F8 (R/  32) Configuration Register */
  __I  PM_VERSION_Type           VERSION;     /**< \brief Offset: 0x3FC (R/  32) Version Register */
 } bf;
 struct {
  RwReg   PM_MCCTRL;          /**< \brief (PM Offset: 0x000) Main Clock Control */
  RwReg   PM_CPUSEL;          /**< \brief (PM Offset: 0x004) CPU Clock Select */
  RoReg8  Reserved10[0x4];
  RwReg   PM_PBASEL;          /**< \brief (PM Offset: 0x00C) PBA Clock Select */
  RwReg   PM_PBBSEL;          /**< \brief (PM Offset: 0x010) PBB Clock Select */
  RwReg   PM_PBCSEL;          /**< \brief (PM Offset: 0x014) PBC Clock Select */
  RwReg   PM_PBDSEL;          /**< \brief (PM Offset: 0x018) PBD Clock Select */
  RoReg8  Reserved11[0x4];
  RwReg   PM_CPUMASK;         /**< \brief (PM Offset: 0x020) CPU Mask */
  RwReg   PM_HSBMASK;         /**< \brief (PM Offset: 0x024) HSB Mask */
  RwReg   PM_PBAMASK;         /**< \brief (PM Offset: 0x028) PBA Mask */
  RwReg   PM_PBBMASK;         /**< \brief (PM Offset: 0x02C) PBB Mask */
  RwReg   PM_PBCMASK;         /**< \brief (PM Offset: 0x030) PBC Mask */
  RwReg   PM_PBDMASK;         /**< \brief (PM Offset: 0x034) PBD Mask */
  RoReg8  Reserved12[0x8];
  RwReg   PM_PBADIVMASK;      /**< \brief (PM Offset: 0x040) PBA Divided Clock Mask */
  RoReg8  Reserved13[0x10];
  RwReg   PM_CFDCTRL;         /**< \brief (PM Offset: 0x054) Clock Failure Detector Control */
  WoReg   PM_UNLOCK;          /**< \brief (PM Offset: 0x058) Unlock Register */
  RoReg8  Reserved14[0x64];
  WoReg   PM_IER;             /**< \brief (PM Offset: 0x0C0) Interrupt Enable Register */
  WoReg   PM_IDR;             /**< \brief (PM Offset: 0x0C4) Interrupt Disable Register */
  RoReg   PM_IMR;             /**< \brief (PM Offset: 0x0C8) Interrupt Mask Register */
  RoReg   PM_ISR;             /**< \brief (PM Offset: 0x0CC) Interrupt Status Register */
  WoReg   PM_ICR;             /**< \brief (PM Offset: 0x0D0) Interrupt Clear Register */
  RoReg   PM_SR;              /**< \brief (PM Offset: 0x0D4) Status Register */
  RoReg8  Reserved15[0x88];
  RwReg   PM_PPCR;            /**< \brief (PM Offset: 0x160) Peripheral Power Control Register */
  RoReg8  Reserved16[0x1C];
  RoReg   PM_RCAUSE;          /**< \brief (PM Offset: 0x180) Reset Cause Register */
  RoReg   PM_WCAUSE;          /**< \brief (PM Offset: 0x184) Wake Cause Register */
  RwReg   PM_AWEN;            /**< \brief (PM Offset: 0x188) Asynchronous Wake Enable */
  RoReg8  Reserved17[0x4];
  RwReg   PM_OBS;             /**< \brief (PM Offset: 0x190) Obsvervability */
  RwReg   PM_FASTSLEEP;       /**< \brief (PM Offset: 0x194) Fast Sleep Register */
  RoReg8  Reserved18[0x260];
  RoReg   PM_CONFIG;          /**< \brief (PM Offset: 0x3F8) Configuration Register */
  RoReg   PM_VERSION;         /**< \brief (PM Offset: 0x3FC) Version Register */
 } reg;
} Pm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_PM_COMPONENT_ */
